
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.lau-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.case-disposer-deletion-failure-alert.azurerm_template_deployment.custom_alert[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.caseDisposerAlertEmail will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "caseDisposerAlertEmail"  {
      + content_type   = (known after apply)
      ~ id             = "https://lau-aat.vault.azure.net/secrets/caseDisposerAlertEmail/e0832aa834754272aed8cc587f97507f" -> (known after apply)
        key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
        name           = "caseDisposerAlertEmail"
      ~ tags           = {
          - "file-encoding" = "utf-8"
        } -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = "e0832aa834754272aed8cc587f97507f" -> (known after apply)
      ~ versionless_id = "https://lau-aat.vault.azure.net/secrets/caseDisposerAlertEmail" -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.case-disposer-deletion-failure-alert.azurerm_template_deployment.custom_alert[0] will be destroyed
  - resource "azurerm_template_deployment" "custom_alert" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Resources/deployments/ccd-case-disposer-aat-deletion-failures" -> null
      - name                = "ccd-case-disposer-aat-deletion-failures" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"          = "ccd-case-disposer-aat-support"
          - "actionGroupRg"            = "ccd-shared-aat"
          - "alertDesc"                = "Alert when case disposer fail to delete case data"
          - "alertName"                = "ccd-case-disposer-aat-deletion-failures"
          - "appInsightsName"          = "ccd-aat"
          - "appInsightsQuery"         = "traces | where message contains 'Case Disposer Deletion Summary'"
          - "commonTags"               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvbGF1LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImxvZy1hbmQtYXVkaXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2xhdS1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJMQVUifQ=="
          - "customEmailSubject"       = "Alert: Case disposer deletion failure"
          - "frequencyInMinutes"       = "15"
          - "location"                 = "West Europe"
          - "severityLevel"            = "2"
          - "timeWindowInMinutes"      = "15"
          - "triggerThreshold"         = "0"
          - "triggerThresholdOperator" = "GreaterThan"
        } -> null
      - resource_group_name = "ccd-shared-aat" -> null
      - template_body       = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName          = {
                      - type = "string"
                    }
                  - actionGroupRg            = {
                      - type = "string"
                    }
                  - alertDesc                = {
                      - type = "string"
                    }
                  - alertName                = {
                      - type = "string"
                    }
                  - appInsightsName          = {
                      - type = "string"
                    }
                  - appInsightsQuery         = {
                      - type = "string"
                    }
                  - commonTags               = {
                      - type = "string"
                    }
                  - customEmailSubject       = {
                      - type = "string"
                    }
                  - frequencyInMinutes       = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - location                 = {
                      - type = "string"
                    }
                  - severityLevel            = {
                      - defaultValue = "3"
                      - type         = "string"
                    }
                  - timeWindowInMinutes      = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - triggerThreshold         = {
                      - type = "string"
                    }
                  - triggerThresholdOperator = {
                      - allowedValues = [
                          - "GreaterThan",
                          - "Equal",
                          - "LessThan",
                        ]
                      - defaultValue  = "GreaterThan"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-09-01-preview"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('alertName')]"
                      - properties = {
                          - action      = {
                              - aznsAction = {
                                  - actionGroup  = [
                                      - "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  - emailSubject = "[parameters('customEmailSubject')]"
                                }
                              - odata.type = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              - severity   = "[parameters('severityLevel')]"
                              - status     = "Active"
                              - trigger    = {
                                  - consecutiveBreach = 1
                                  - threshold         = "[parameters('triggerThreshold')]"
                                  - thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          - description = "[parameters('alertDesc')]"
                          - enabled     = "true"
                          - schedule    = {
                              - frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              - timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          - skuType     = "L1"
                          - source      = {
                              - dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              - query        = "[parameters('appInsightsQuery')]"
                              - queryType    = "ResultCount"
                            }
                        }
                      - tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - additionalTags = {
                      - [concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))] = "Resource"
                    }
                  - tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.lau-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat|lau-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "lau-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 0 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"","Vars":{}} -->